papers/JFNK_quasi_monolithic_FSI/fluidSolidInteraction/3dTube/base/partitioned.robin/system/fluid/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.3                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

vertices
(
    (0 0 0)                  // 0
    (0.003414 0 0)           // 1
    (0.002828 0.002828 0)    // 2
    (0 0.003414 0)           // 3

    (0.005 0 0)              // 4
    (0.003536 0.003536 0)    // 5
    (0 0.005 0)              // 6

    (0 0 0.05)               // 7
    (0.003414 0 0.05)        // 8
    (0.002828 0.002828 0.05) // 9
    (0 0.003414 0.05)        // 10

    (0.005 0 0.05)           // 11
    (0.003536 0.003536 0.05) // 12
    (0 0.005 0.05)           // 13
);

blocks
(
    hex (0 1 2 3 7 8 9 10) (10 10 80) simpleGrading (1 1 1)
    hex (1 4 5 2 8 11 12 9) (5 10 80) simpleGrading (1 1 1)
    hex (3 2 5 6 10 9 12 13) (10 5 80) simpleGrading (1 1 1)
);

edges
(
    arc 4 5 (0.004619 0.001913 0)
    arc 5 6 (0.001913 0.004619 0)

    arc 11 12 (0.004619 0.001913 0.05)
    arc 12 13 (0.001913 0.004619 0.05)
);

patches
(
    patch outlet
    (
        (10 9 8 7)
        (13 12 9 10)
        (12 11 8 9)
    )
    patch inlet
    (
        (0 1 2 3)
        (1 4 5 2)
        (3 2 5 6)
    )
    wall wall
    (
        (13 12 5 6)
        (12 11 4 5)
    )
    symmetry symmetry-x
    (
        (7 10 3 0)
        (10 13 6 3)
    )
    symmetry symmetry-y
    (
        (0 1 8 7)
        (1 4 11 8)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
